{
  "livros": [
    {
      "id": 2,
      "nomeLivro": "Spring MVC: Domine o principal framework web Java",
      "descricaoLivro": "O Spring é o principal concorrente da especificação JavaEE. Com uma plataforma muito estável e com integração fina entre todas as suas extensões, fornece um ambiente muito propício para que o programador foque nas regras de negócio e esqueça dos problemas de infraestrutura.   Durante o livro, será construída uma aplicação baseada na loja da Casa do Código e você terá a chance de utilizar diversas das funcionalidades e integrações providas pelo framework. Usaremos o Spring MVC como alicerce da nossa aplicação web e para implementar todas as funcionalidades, utilizaremos diversas integrações, como: Spring JPA, para facilitar o acesso ao banco de dados; Spring Security, para segurança da aplicação; diferenciação de ambientes com a parte de Profiles; respostas assíncronas para melhorarmos a escalabilidade; e ainda detalhes, como cache e suporte às requisições, seguindo o estilo REST.   Tudo isso sem uma linha de XML, todas configurações serão feitas baseadas em anotações e código Java.",
      "dataPublicacao": " 06/2015",
      "numeroPaginas": 96,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/spring-mvc-miniature.png?",
      "autores": [
        {
          "idAutor": 2,
          "nomeAutor": "Alberto Souza",
          "detalhesAutor": "Alberto Souza é Bacharel em Ciência da Computação pela Universidade Salvador e desenvolvedor desde 2005, tendo participado de muitos projetos web e experimentado diversas linguagens. Participa de projetos open source como o Stella e VRaptor. Possui a certificação SCJP e trabalha como desenvolvedor e instrutor pela Caelum. Seu Twitter é @alberto_souza e você também pode encontrá-lo no Github, no endereço http://www.github.com/asouza",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/alberto-souza_medium.png"
        }
      ]
    },
    {
      "id": 14,
      "nomeLivro": "Explorando APIs e bibliotecas Java: JDBC, IO, Threads, JavaFX e mais",
      "descricaoLivro": "Uma vez que você aprende Orientação a Objetos e o básico do Java, é necessário se tornar fluente em suas APIs, que não são poucas. Um programador Java eficaz conhece o que há disponível e sabe quando pode usar cada uma das possibilidades que a linguagem lhe oferece. É isso que queremos para você.  Rodrigo Turini ensina como lidar com as diferentes APIs do Java com exemplos práticos e que são relevantes no seu dia a dia. Você vai aprender as diferentes APIs para fazer IO, trabalhar com threads da forma correta, se conectar com banco de dados via JDBC, integrar com ferramentas de build e muito mais.",
      "dataPublicacao": " 05/2015",
      "numeroPaginas": 163,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/cover-apis-java_medium.jpeg?v=1423244220",
      "autores": [
        {
          "idAutor": 13,
          "nomeAutor": "Rodrigo Turini",
          "detalhesAutor": "Rodrigo Turini é Bacharel em Ciência da Computação, desenvolvedor, instrutor pela Caelum e autor de cursos do Alura. Desenvolve sistemas principalmente em Java e, atualmente, participa do expert group que mantém a JSR 371 (Model-View-Controller) e JSR 370 (JAX-RS 2.1), sendo a primeira uma nova especificação do JavaEE 8. Rodrigo tem participação ativa na comunidade, participando de diversas listas de discussões sobre linguagens e frameworks, e tendo palestrado em eventos no Brasil e exterior, como DevCamp 2013 e JavaOne 2014, em San Francisco. É um dos líderes de desenvolvimento do VRaptor e contribui para diversos outros projetos open source. Gosta de estudar continuamente as melhores práticas da orientação a objetos, programação funcional e Java 8.",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/rodrigo-turini_small.png?54691"
        }
      ]
    },
    {
      "id": 17,
      "nomeLivro": "Componentes Reutilizáveis em Java com Reflexão e Anotações",
      "descricaoLivro": "Muitos dos recursos providos pelos frameworks e componentes mais utilizados na indústria extrapolam os simples conceitos da Orientação a Objetos e fazem uso de reflexão e anotações. A utilização dessas poderosas ferramentas pode fazer uma grande diferença, com potencial de aumentar a produtividade do time e melhorar a estrutura do código.  Neste livro, o uso de reflexão e anotações é abordado por completo, indo desde o funcionamento da API até boas práticas em sua utilização. Além disso, o livro também fala sobre ferramentas de código aberto, manipulação de bytecode e as novidades sobre reflexão do Java 8. Suba de nível em suas habilidades de programação aprendendo essa técnica que vai lhe permitir escrever códigos extremamente flexíveis.",
      "dataPublicacao": " 05/2015",
      "numeroPaginas": 163,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/reflexao-anotacoes-featured_medium.png?v=1416318033",
      "autores": [
        {
          "idAutor": 13,
          "nomeAutor": "Eduardo Guerra",
          "detalhesAutor": "Eduardo Guerra é desenvolvedor de frameworks, editor-chefe da revista MundoJ e pesquisador do Instituto Nacional de Pesquisas Espaciais (INPE). Foi professor do Instituto Tecnológico de Aeronáutica (ITA), onde concluiu sua graduação, mestrado e doutorado. Suas pesquisas concentram-se nas áreas de design, arquitetura e teste de software. Possui diversas certificações da plataforma Java e experiência como arquiteto de software. Participa de projetos de frameworks open-source, como SwingBean, Esfinge e ClassMock. Ele acredita que um bom software faz-se mais com criatividade do que com código e vive em busca de melhores formas para seu desenvolvimento.",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/eduardo-guerra_small.png?54691"
        }
      ]
    },
    {
      "id": 18,
      "nomeLivro": "Aplicações Java para a web com JSF e JPA",
      "descricaoLivro": "Neste livro, você encontrará as especificações mais utilizadas do Java, explicadas com exemplos práticos e claros que mostram como usar cada tecnologia em separado e como utilizá-las em conjunto.  Conheças as melhores práticas da JPA 2.0, seus mapeamentos, caches e truques de performance, e tire o máximo do JSF 2.2 compreendendo seu ciclo de vida e as novidades que surgiram nas atuais versões das especificações.",
      "dataPublicacao": " 05/2015",
      "numeroPaginas": 163,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/jsf-jpa-featured_medium.png?v=1411486340",
      "autores": [
        {
          "idAutor": 13,
          "nomeAutor": "Gilliard Santos Cordeiro",
          "detalhesAutor": "Gilliard Santos Cordeiro é Analista de Sistemas pela UFMS e especialista em Engenharia de Software pela Uniderp. É também tomador de tereré, tirador de foto, pescador e karateca amador. Iniciou tomando tereré desde muito cedo, como todo sul-mato-grossense, mas na programação só teve o primeiro contato na faculdade, em 2002.  O início profissional foi em 2003, onde como estagiário programou em Lotus Script e um ano depois começou a desenvolver em Java. Algum tempo depois, junto com outros amigos fundou o JUGMS, que hoje organiza anualmente o Javaneiros, o maior evento de desenvolvedores de Mato Grosso do Sul. O gosto pela pesca e pelo karatê veio depois de 'velho', aos 28 anos. Foi coordenador de novas tecnologias (P&D) no Tribunal de Justiça de MS, onde atualmente é diretor da área de desenvolvimento de sistemas. Ele mantém um blog em http://gilliard.eti.br.",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/gilliard-cordeiro_small.png?54691"
        }
      ]
    }
  ]
}
