{
  "livros": [
    {
      "id": 8,
      "nomeLivro": "CSS Eficiente: Técnicas e ferramentas que fazem a diferença nos seus estilos",
      "descricaoLivro": "Quando aprendemos a trabalhar com CSS, frequentemente nos pegamos perdidos em detalhes fundamentais que não nos são explicados. Por vezes, alguns desses detalhes passam despercebidos até pelo desenvolvedor front-end mais experiente. Mas como ir além do conhecimento básico do CSS e preparar o caminho para explorar tópicos mais avançados?  Neste livro, Tárcio Zemel ensina como organizar seu estilo, entender especificidade, como usar diferentes seletores, trabalhar orientado a objetos com CSS e várias outras técnicas que farão diferença no dia a dia do trabalho com os estilos e abrirão novas possibilidades para você explorar ainda mais o CSS.",
      "dataPublicacao": " 05/2015",
      "numeroPaginas": 163,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/css-eficiente-featured_medium.png",
      "autores": [
        {
          "idAutor": 10,
          "nomeAutor": "Tárcio Zemel",
          "detalhesAutor": "Tárcio Zemel trabalha com desenvolvimento web há 15 anos e atuar nessa área é uma das coisas que mais gosta de fazer. É sócio-fundador da empresa webfatorial, na qual trabalha em projetos web para grandes marcas do mundo todo.",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/tarcio-zemel_small.png?54691"
        }
      ]
    },
    {
      "id": 15,
      "nomeLivro": "Test-Driven Development: Teste e Design no Mundo Real com PHP",
      "descricaoLivro": "Por que não testamos software? Porque é caro? Porque é demorado? Porque é chato? Testes automatizados são a solução para todos esses problemas. Aprenda a escrever um programa que testa seu programa de forma rápida, barata e produtiva, e aumente a qualidade do seu produto final.  Neste livro, você aprenderá sobre TDD, uma das práticas ágeis de desenvolvimento de software mais populares. TDD faz o desenvolvedor escrever o teste antes mesmo de implementar o código. Essa simples inversão na maneira de se trabalhar faz com o que o desenvolvedor escreva um código mais testado, com menos bugs, e, inclusive, com mais qualidade. Seja profissional, teste seu software!",
      "dataPublicacao": " 05/2015",
      "numeroPaginas": 163,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1",
      "imagemUrl": "http://cdn.shopify.com/s/files/1/0155/7645/products/cover_ce399913-9822-4509-ab16-fad1cfad2df3_medium.jpeg?v=1421769309",
      "autores": [
        {
          "idAutor": 16,
          "nomeAutor": "Andre Cardoso",
          "detalhesAutor": "Andre Cardoso é desenvolvedor PHP, bacharelando em Análise e Desenvolvimento de Sistemas, Técnico em Informática com foco em desenvolvimento de sistemas Web-based. Trabalha exclusivamente com PHP há cerca de 5 anos e durante este período esteve envolvido em projetos de todos os portes para grandes clientes como HSBC, Renault e Liquigás. Também desenvolveu sistemas para inúmeras startups nos estados do Paraná, Santa Catarina e São Paulo. Antes do PHP, aventurou-se com Java, um pouco de .Net e Delphi, mas foi no PHP que decidiu focar e especializar-se.  Atualmente, trabalha na empresa Redsuns Tecnologia em Curitiba que tem foco em soluções tecnológicas inteligentes e desenvolvimento de startups.  Ministrou palestras e workshops sobre TDD, PHP e tecnologias que o complementam  nos eventos SFD (Software Freedom Day), FTSL (Fórum de Tecnologia em Software Livre) e  FLISOL (Festival Latino Americano de Instalação de Software Livre). Tem uma enorme satisfação  como profissional em compartilhar conhecimento e faz isso participando de diversos grupos  de discussões e alguns projetos open source.",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/andre-cardoso_medium.png?54691"
        },
        {
          "idAutor": 14,
          "nomeAutor": "Maurício Aniche",
          "detalhesAutor": "Maurício é instrutor e desenvolvedor da Caelum, possui mais de 9 anos de experiência de desenvolvimento de softwares, tendo participado de projetos para grandes empresas nacionais e internacionais. Mauricio é também mestre em Ciência da Computação pela Universidade de São Paulo (USP), onde pesquisa sobre TDD e sua influência no design de sistemas orientados a objetos. Atualmente, é aluno de doutorado pelo mesmo instituto. Palestrante em eventos nacionais e internacionais, com destaque para sua apresentação no 1º Workshop Internacional sobre Test-Driven Development, localizado em Paris, no ano de 2010, Agile Brazil 2010, 2011 e 2012, e QCON SP 2010 e 2012. Mauricio gosta de discutir sobre TDD, melhores práticas e princípios de orientação a objetos, métodos ágeis de desenvolvimento de software e linguagens de programação. Está no Twitter como @mauricioaniche .",
          "imagemAutor": "http://cdn.shopify.com/s/files/1/0155/7645/files/mauricio-aniche_small.png?54691"
        }
      ]
    }
  ]
}
