{
  "livros": [
    {
      "id": 1,
      "nomeLivro": "Jogos Android: Crie um game do zero usando classes nativas",
      "descricaoLivro": "195, 300, 800 milhões de dólares!!! Essas são as cifras por trás dos jogos Angry Birds, Candy Crush e Clash of Clans. Quer pensar em cifras menores? Que tal 120 mil reais por dia? Foi o que Flappy Bird chegou a faturar. Pois é, já pensou em trabalhar com algo criativo, divertido e recompensador? Desenvolver jogos pode ser assim.   Neste livro, Felipe Torres mostra como criar um jogo do zero sem usar frameworks e discute as vantagens e desvantagens dessa abordagem usada pelo criador de Flappy Bird. Usando a linguagem Java, você vai desenvolver um jogo para Android e entender de fato como funciona a criação de jogos através da óptica do desenvolvedor e terá mais confiança e informação para decidir os caminhos do que esperamos. Seja o novo jogo viral do mercado!",
      "dataPublicacao": " 06/2015",
      "numeroPaginas": 96,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1"
    },
    {
      "id": 2,
      "nomeLivro": "Spring MVC: Domine o principal framework web Java",
      "descricaoLivro": "O Spring é o principal concorrente da especificação JavaEE. Com uma plataforma muito estável e com integração fina entre todas as suas extensões, fornece um ambiente muito propício para que o programador foque nas regras de negócio e esqueça dos problemas de infraestrutura.   Durante o livro, será construída uma aplicação baseada na loja da Casa do Código e você terá a chance de utilizar diversas das funcionalidades e integrações providas pelo framework. Usaremos o Spring MVC como alicerce da nossa aplicação web e para implementar todas as funcionalidades, utilizaremos diversas integrações, como: Spring JPA, para facilitar o acesso ao banco de dados; Spring Security, para segurança da aplicação; diferenciação de ambientes com a parte de Profiles; respostas assíncronas para melhorarmos a escalabilidade; e ainda detalhes, como cache e suporte às requisições, seguindo o estilo REST.   Tudo isso sem uma linha de XML, todas configurações serão feitas baseadas em anotações e código Java.",
      "dataPublicacao": " 06/2015",
      "numeroPaginas": 96,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1"
    },
    {
      "id": 3,
      "nomeLivro": "Testes automatizados de software: Um guia prático",
      "descricaoLivro": "Quantas vezes você não colocou um 'else' a mais ou trocou um maior por maior-igual? Problemas como esses acontecem todos os dias em nossos códigos. E aposto que você sabe como evitá-los: testando seu software. A grande pergunta é: por que evitamos (ou pior, odiamos) testar?  Testar custa caro, é demorado e é chato. Mas tudo isso só é verdade, pois ainda delegamos essas tarefas para um ser humano. Este livro mostra de maneira prática como escrever um programa que fará esse teste por você!  Mergulhe de cabeça nessa ideia, aprenda a escrever testes automatizados, e passe a dormir bem, tranquilo, pois seu software agora funciona.",
      "dataPublicacao": " 06/2015",
      "numeroPaginas": 96,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1"
    },
    {
      "id": 4,
      "nomeLivro": "PL/SQL: Domine a linguagem do banco de dados Oracle",
      "descricaoLivro": "Durante o dia, milhões de dados trafegam por servidores ao redor do mundo. São informações de todo tipo e muitas delas precisam ser preservadas. Qual a forma de fazer isso? Persistindo os dados.  Neste livro, Eduardo Gonçalves mostra o poder da linguagem PL/SQL e como você pode conseguir um alto grau de produtividade e performance para as suas aplicações. Os leitores iniciantes terão contato com conceitos sobre a estrutura da linguagem PL/SQL e suas características, e criarão programas, dos mais simples até os mais complexos, para atender às mais diversas necessidades. Para os já experientes, ajudará como fonte de referência e para atualizar conceitos e técnicas da linguagem.",
      "dataPublicacao": " 06/2015",
      "numeroPaginas": 96,
      "valorFisico": 59.9,
      "valorVirtual": 39.9,
      "valorVirtualComFisico": 79.9,
      "ISBN": "978-85-5519-013-1"
    }
  ]
}
